var initData = [{
	bg: "images/bg_2019.jpg",
	fontSize: 24,
	headPosition: [
		//x：坐标，y：坐标，z：半径
		{
			x: 220,
			y: 365,
			z: 28
		},
		{
			x: 580,
			y: 366,
			z: 28
		},
		{
			x: 177,
			y: 672,
			z: 28
		},
		{
			x: 514,
			y: 692,
			z: 13
		}
	],
	lg: [{
			0: ["这孩子咋样"],
			1: ["整天说要减肥，就是管不住那张吧唧吧唧吃个不停的嘴"],
			2: ["放心，我会禁止ta吃零食的"],
			3: ["...等一下"],
			4: ["那个ta那么爱吃就不要禁了，ta还爱毛爷爷，拜托啦"]
		},
		{
			0: ["这孩子咋样"],
			1: ["整天说要健康，一到周末就肥宅根本不想出去锻炼"],
			2: ["放心，以后我不会让ta宅着了"],
			3: ["...等一下"],
			4: ["逼他锻炼可以，请你继续宠爱溺爱ta，拜托啦"]
		}, {
			0: ["这孩子咋样"],
			1: ["条件挺好的，但是单身狗一枚，也不会照顾自己"],
			2: ["行，那我们走了"],
			3: ["等一下"],
			4: ["新的一年给ta找个好对象，照顾ta吧，拜托了"]
		},
	],
}, {
	bg: "images/bg_2020.jpg",
	headPosition: [
		//x：坐标，y：坐标，z：半径
		{
			x: 222,
			y: 365,
			z: 30
		},
		{
			x: 581,
			y: 366,
			z: 30
		},
		{
			x: 224,
			y: 672,
			z: 30
		},
		{
			x: 582,
			y: 672,
			z: 30
		},
		{
			x: 398,
			y: 978,
			z: 30
		}
	],
	lg: [{
			0: ["这孩子咋样"],
			1: ["实力不错的，就是想要的东西我给不了，只能交给你了"],
			2: ["孩子，你想要什么", "一个亿"],
			3: ["……"],
			4: ["滚！"]
		},
		{
			0: ["这孩子咋样"],
			1: ["实力还是可以的，就是想要的东西我给不了，现在只能交给你了"],
			2: ["孩子，你想要什么", "一个亿"],
			3: ["……"],
			4: ["打一顿就好了"]
		}, {
			0: ["这孩子咋样"],
			1: ["成天早出晚归也不知道在忙啥"],
			2: ["也不好好吃饭倒是小小年纪开始养生总之交给你了"],
			3: ["再见"],
			4: ["我会让这家伙的努力有回报的！并且不秃头"]
		}, {
			0: ["这孩子咋样"],
			1: ["小小一个人心里装的都是人家"],
			2: ["每个朋友都放心上去不够关心自己交给你了"],
			3: ["再见"],
			4: ["这小傻瓜我罩了！还有家人朋友，一起照顾了"]
		}
	]
}, {
	bg: "images/bg_me.jpg",
	headPosition: [{
			x: 221,
			y: 364,
			z: 30
		},
		{
			x: 588,
			y: 364,
			z: 30
		},
		{
			x: 187,
			y: 665,
			z: 30
		},
		{
			x: 548,
			y: 661,
			z: 30
		},
		{
			x: 410,
			y: 965,
			z: 30
		}
	],
	lg: [{
			0: ["这孩子咋样"],
			1: ["我很喜欢ta，只是……"],
			2: ["怎么", "它不疼我"],
			3: ["我退休了，先走一步"],
			4: ["让我人瘦点儿，钱包鼓点儿！拜托了，千万再别整错了，去年就整反了"]
		},
		{
			0: ["这孩子咋样"],
			1: ["我宠爱ta一年，就一件事没满足ta，要不你试试？"],
			2: ["放心，我也会宠爱+溺爱，娃你大胆说"],
			3: ["那……我走了"],
			4: ["如果没办法把我变瘦，就请把我的朋友们变胖吧哈哈"]
		}, {
			0: ["这孩子咋样"],
			1: ["啥都好就是老琢磨自己胖、丑、穷，衰，都已经很好了TA不信"],
			2: ["是啊，我看着这娃挺好啊"],
			3: ["……"],
			4: ["……", "这叫挺好？好胖、好穷吗，要不先给我一个亿？"]
		},
	]
}, {
	bg: "images/bg_me1.jpg",
	headPosition: [{
			x: 221,
			y: 364,
			z: 30
		},
		{
			x: 584,
			y: 360,
			z: 30
		},
		{
			x: 290,
			y: 670,
			z: 30
		},
		{
			x: 656,
			y: 670,
			z: 30
		},
		{
			x: 386,
			y: 995,
			z: 14
		}
	],
	lg: [{
			0: ["孩子，我们走吧"],
			1: ["养了三百多天了，舍不得！"],
			2: ["不走，我也舍不得"],
			3: ["我这有车有房还有升职加薪……"],
			4: ["20我们赶紧走吧"]
		},
		{
			0: ["孩子，我们走吧"],
			1: ["365天，希望我给你留下了所有美好回忆！"],
			2: ["不走，我还做19的孩子"],
			3: ["也没娃跟我走，可惜我这...车房还有升职加薪的机会了"],
			4: ["20你不是还有我吗"]
		},
	]
}]